{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "ResNet",
    "parent_library": "torchvision.models.resnet"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "layer2.0.conv1",
    "fc",
    "conv1",
    "layer1.0.conv1",
    "layer3.0.conv1",
    "layer4.0.conv1"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}